Autodesk.Revit.DB.Structure.BoundaryConditions.GetLoops
Returns curve loops that define geometry of the area boundary conditions.
Remarks:
Boundary conditions should be BoundaryConditionsType::Area type. Otherwise exception is thrown.
Returns:
The curve loop collection.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
Thrown when BoundaryConditions is not a BoundaryConditionsType::Area type.
Since:
2016

Autodesk.Revit.DB.Structure.BoundaryConditions.GetCurve
Returns curve that define geometry of the line boundary conditions.
Remarks:
Boundary conditions should be BoundaryConditionsType::Line type. Otherwise exception is thrown.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
Thrown when BoundaryConditions is not a BoundaryConditionsType::Line type.
Since:
2016

Autodesk.Revit.DB.Structure.BoundaryConditions.GetDegreesOfFreedomCoordinateSystem
Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation.
Returns:
The coordinate system. Origin contains the position of the start of the boundary conditions. BasisX, BasisY and BasisZ contain the directions of the axes in the global coordinate system.
Since:
2015

Autodesk.Revit.DB.Structure.BoundaryConditions.SetOrientTo(Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo)
Sets the boundary condition orientation option.
orientTo:
The new orientation option.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.BoundaryConditions.GetOrientTo
Returns the boundary conditions orientation option.
Returns:
The orientation option.
Since:
2015

Autodesk.Revit.DB.Structure.BoundaryConditions.GetBoundaryConditionsType
Returns the boundary conditions type.
Returns:
The boundary conditions type.
Since:
2015

Autodesk.Revit.DB.Structure.BoundaryConditions.Point
Returns the position of point boundary conditions.
Remarks:
Boundary conditions should be BoundaryConditionsType::Point type. Otherwise exception is thrown.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
Thrown when BoundaryConditions is not a BoundaryConditionsType::Point type.

Autodesk.Revit.DB.Structure.BoundaryConditions.AssociatedLoadId
The Id of the internal load element associated with a boundary conditions.
Remarks:
ElementId may be set if the internal load exists and it's type fit the BoundaryConditions type only (Point, Line and Area).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: elementId is not a valid Element identifier.
-or-
When setting this property: Throws when the ElementId does not refer to the internal load with appropriate type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.BoundaryConditions.HostElement
The host element for the boundary conditions.

Autodesk.Revit.DB.Structure.BoundaryConditions.HostElementId
The host element Id for the boundary conditions.
Since:
2016

Autodesk.Revit.DB.Structure.BoundaryConditions
An object that represents a force applied across an area.